jonGetUp/nRF-WirelessCycle/nRF5_SDK_15.3.0_59ac345/examples/ble_peripheral/ble_app_blinky/main.c
BLE_LBS_DEF(m_lbs);                                                             /**< LED Button Service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/

// OUR_JOB: Step 3.G, Declare an app_timer id variable and define our timer interval and define a timer interval
APP_TIMER_DEF(m_lbs_timer_id);
#define LBS_CHAR_TIMER_INTERVAL     APP_TIMER_TICKS(1000) // 1000 ms intervals


static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

void send_pulse_IRQ_BT(void)
{
    //txBuffer loaded and ready to be readed -> pulse Interrupt request to the master
    nrf_gpio_pin_set(IRQ_BT_PIN);    
    nrf_delay_us(10); //delay min allow the PIC to detect the pulse
    nrf_gpio_pin_clear(IRQ_BT_PIN);
}

void spis_reset_tx_buffer(void)
{
    for(int i=0; i < SPI_BUFFER_SIZE; i++)
    {
        m_tx_buf[i] = 0;
    }
}

// BLE_WRITE:
/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] characteristic1_value table of uint8_t containing the value that was received from the phone
 */
// called from our_services.c from on_write();
// Make a note of the arguments that are passed to this handler, we will use that later on
static void characteristic1_value_write_handler(uint32_t characteristic1_value)
{
        spis_reset_tx_buffer();
	NRF_LOG_INFO("We have received the characteristic1 value into our App:  %x", characteristic1_value);
        m_tx_buf[0] = 0x0B; //function code
        m_tx_buf[1] = 0x04; //data size (bytes)
        //little to big endian conversion
        m_tx_buf[5] = (uint8_t)  characteristic1_value; //desired function code
        m_tx_buf[4] = (uint8_t) (characteristic1_value>>8); //desired function code
        m_tx_buf[3] = (uint8_t) (characteristic1_value>>16); //desired function code
        m_tx_buf[2] = (uint8_t) (characteristic1_value>>24); //desired function code

        send_pulse_IRQ_BT();
        
}
// Add other handlers here...

//tell the SPI master wich variable to return
void spis_send_function_code(uint8_t functionCode)
{
    m_tx_buf[0] = 0x7F; //Acknowledge, send function code and data
    m_tx_buf[1] = 0x01; //data size
    m_tx_buf[2] = functionCode; //desired function code

//    switch(functionCode)
//    {
//      case 0x03:
//        m_tx_buf[2] = 0x03; //desired function code
//        break;
//      default:
//        break;
//    }
    //txBuffer loaded and ready to be readed -> pulse Interrupt request to the master
    send_pulse_IRQ_BT();
            
//    switch(frameIndex)
//    {
//      case 0:
//        m_tx_buf[0] = 0x7F; //Acknowledge, send function code and data
//        break;
//      case 1:
//        m_tx_buf[0] = 0x0B; //Acknowledge, send function code and data
//        break;
//      case 2:
//        frameIndex = -1;    //Read the last byte
//        break;
//    }
}

//write the master serial number
void spis_write_master_serial_number(void)
{
    m_tx_buf[0] = 0x0B; //Acknowledge, send function code and data
    m_tx_buf[1] = 0x04; //data size (bytes)
    m_tx_buf[2] = (uint8_t) serialNumber; //desired function code
    m_tx_buf[3] = (uint8_t) (serialNumber>>8); //desired function code
    m_tx_buf[4] = (uint8_t) (serialNumber>>16); //desired function code
    m_tx_buf[5] = (uint8_t) (serialNumber>>24); //desired function code

    nrf_gpio_pin_set(IRQ_BT_PIN);
    nrf_delay_us(10); //delay min allow the PIC to detect the pulse
    nrf_gpio_pin_clear(IRQ_BT_PIN);
}

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
}

static void timer_timeout_handler(void * p_context)
{
    // OUR_JOB: Step 3.F, Update temperature and characteristic value.
    spis_send_function_code(0x03);  //
    ble_lbs_batVolt_characteristic_update(m_conn_handle, &m_lbs, &batVolt);  //call the characteristic update function
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // OUR_JOB: Step 3.H, Initiate our timer
    app_timer_create(&m_lbs_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
    //call the timeout handler, repeatedly (else APP_TIMER_MODE_SINGLE_SHOT)
}


