jonGetUp/nRF-WirelessCycle/nRF5_SDK_15.3.0_59ac345/examples/ble_peripheral/ble_app_blinky/main.c
        NRF_UICR->REGOUT0 = (NRF_UICR->REGOUT0 & ~((uint32_t)UICR_REGOUT0_VOUT_Msk)) |
                            (UICR_REGOUT0_VOUT_3V3 << UICR_REGOUT0_VOUT_Pos);

        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren; /*!< Read only access */
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

        // System reset is needed to update UICR registers.
        NVIC_SystemReset();
    }
}

static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

void spis_read_batVolt_master(void)
{
        batVolt = (((uint16_t)m_rx_buf[2])<<8)& 0xFF00; //read 8 LSB
        batVolt = batVolt + (((uint16_t)m_rx_buf[3]) & 0x00FF);                 //read 8 MSB

//    switch(frameIndex)
//    {
//      case 0:
//        m_tx_buf[0] = 0x0B; //Acknowledge, send function code and data
//        break;
//      case 1:
//        batVolt = ((uint16_t)m_rx_buf[0]) & 0x00FF;  //read 8 MSB
//        break;
//      case 2:
//        batVolt = batVolt + ((((uint16_t)m_rx_buf[0])<<8)& 0xFF00);     //read 8 LSB
//        frameIndex = -1;
//        break;
//      case 3:
//        frameIndex = -1;  
//        break;
//      default:
//        frameIndex = -1;
//        break;
//    }
}

/**
 * @brief SPIS user event handler.
 *
 * @param event
 */
void spis_event_handler(nrf_drv_spis_event_t event)
{
    if (event.evt_type == NRF_DRV_SPIS_XFER_DONE)
    {
        spis_reset_tx_buffer();
        spis_xfer_done = true;
        //NRF_LOG_INFO(" Transfer completed. Received: %x",(uint32_t)(m_rx_buf[0]<<16 & m_rx_buf[1]<<8 & m_rx_buf[2]));
        NRF_LOG_INFO(" Transfer completed. Received: %x",m_rx_buf[0]);
        //m_rx_buffer cleared when readed

        //first sended byte is the fonctionCode
//        if(frameIndex == 0)
//        {
          frameFonctionCode = m_rx_buf[0];
//        }
        switch(frameFonctionCode)
        {
          case 0x7F:
            //spis_send_function_code();
            break;
          case 0x03:
            spis_read_batVolt_master();
            break;
          case 0x00:  //do nothing, master read the slave
            break;
          default:
            //communication error
            NRF_LOG_INFO("ILLEGAL FUNCTION");
            //1: send function code with MSB at 1
            spis_reset_tx_buffer();
            m_tx_buf[0] = frameFonctionCode + 0x80; 
//            frameError = 1;
//            //2: send exception code illegal function 
//            if(frameIndex == 1)
//            {
              m_tx_buf[1] = ILLEGAL_FUNCTION;
//            }
//            //3. let the PIC read the ILLEGAL FUNCTION excpetion code and reset the index
//            if(frameIndex > 1)
//            {
//              frameIndex = -1;
//              frameError = 0;
//              //return; //exit the function whitout incrementing the frameIndex
//            }
            break;
        }
        frameIndex++;
    }
}

/**
 * Function for configuring the spi peripheral as slave
 */
static void spi_init(void)
{
      // Enable the constant latency sub power mode to minimize the time it takes
    // for the SPIS peripheral to become active after the CSN line is asserted
    // (when the CPU is in sleep mode).
    NRF_POWER->TASKS_CONSTLAT = 1;

    //bsp_board_init(BSP_INIT_LEDS);

    //APP_ERROR_CHECK(NRF_LOG_INIT(NULL));
    //NRF_LOG_DEFAULT_BACKENDS_INIT();

    NRF_LOG_INFO("SPIS example");
    
    //SPI configuration
    nrf_drv_spis_config_t spis_config = NRF_DRV_SPIS_DEFAULT_CONFIG;
    spis_config.csn_pin               = APP_SPIS_CS_PIN;
    spis_config.miso_pin              = APP_SPIS_MISO_PIN;
    spis_config.mosi_pin              = APP_SPIS_MOSI_PIN;
    spis_config.sck_pin               = APP_SPIS_SCK_PIN;
    //SPI init with event handler callback function
    APP_ERROR_CHECK(nrf_drv_spis_init(&spis, &spis_config, spis_event_handler));
}

/**
 * Function call in the while(1), handle the SPI communications
 */
void spis_handle(void)
{
    memset(m_rx_buf, 0, m_length);
    spis_xfer_done = false;

    //Set the SPI TX/RX buffer
    APP_ERROR_CHECK(nrf_drv_spis_buffers_set(&spis, m_tx_buf, m_length, m_rx_buf, m_length));

    //wait until transfer is done (wait that the master give the clock)
    while (!spis_xfer_done)
    {
        __WFE();  //Wait For Event
    }

    NRF_LOG_FLUSH();
}

/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    log_init();
    leds_init();
    timers_init();
    buttons_init();
    power_management_init();
    gpio_output_voltage_setup();
    spi_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    nrf_gpio_cfg_output(IRQ_BT_PIN);  // Set IRQ PIN pin as output
    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    advertising_start();

    // Enter main loop.
    while(1)
    {
        idle_state_handle();
        spis_handle();
    }
}


/**
 * @}
 */
